results/mongodb/run_workload_a.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-01-02 19:57:53:806 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongodb:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-01-02 19:57:59:384 5 sec: 100000 operations; 17828.49 current ops/sec; [READ: Count=50098, Max=120447, Min=192, Avg=497.39, 90=726, 99=2557, 99.9=13087, 99.99=82879] [CLEANUP: Count=10, Max=6855, Min=1, Avg=714.3, 90=272, 99=6855, 99.9=6855, 99.99=6855] [UPDATE: Count=49902, Max=105663, Min=202, Avg=521.62, 90=743, 99=2807, 99.9=13295, 99.99=88319] 
[OVERALL], RunTime(ms), 5609
[OVERALL], Throughput(ops/sec), 17828.489926903192
[TOTAL_GCS_G1_Young_Generation], Count, 24
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 84
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.4975931538598681
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 24
[TOTAL_GC_TIME], Time(ms), 84
[TOTAL_GC_TIME_%], Time(%), 1.4975931538598681
[READ], Operations, 50098
[READ], AverageLatency(us), 497.3903349435107
[READ], MinLatency(us), 192
[READ], MaxLatency(us), 120447
[READ], 95thPercentileLatency(us), 1005
[READ], 99thPercentileLatency(us), 2557
[READ], Return=OK, 50098
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 714.3
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 6855
[CLEANUP], 95thPercentileLatency(us), 6855
[CLEANUP], 99thPercentileLatency(us), 6855
[UPDATE], Operations, 49902
[UPDATE], AverageLatency(us), 521.6196545228648
[UPDATE], MinLatency(us), 202
[UPDATE], MaxLatency(us), 105663
[UPDATE], 95thPercentileLatency(us), 1031
[UPDATE], 99thPercentileLatency(us), 2807
[UPDATE], Return=OK, 49902